tutorials/incompressibleVoF/planingHullW3/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water 0;
}

zones
{
    cell
    {
        type        box;
        zoneType    cell;

        box         (-999 -999 -999) (999 999 0.065);

        values
        {
            alpha.water 1;
        }
    }

    patchFaces
    {
        type        box;
        zoneType    face;

        box         (-999 -999 -999) (999 999 0.065);

        zone
        {
            type        patch;
            patches     (inlet outlet);
        }

        values
        {
            alpha.water 1;
        }
    }
}

// ************************************************************************* //
